[
  {
    "app": "Advent Media Player",
    "latest": "2.3.0.0",
    "release": "2025-09-05",
    "install_link": "https://1drv.ms/u/c/50e9a5b8731dba9b/Eb0L2XqmkDhMjwBZxh9eZ5QBqOTkS6CmZD4hh56pJF1T9A?e=jkAdls",
    "data": "https://drive.google.com/drive/folders/1cbQl2UBnqxOgSw0Q5F6wfwOJ1zPKUUya?usp=sharing",
    "changelog" : "<h2> Version 2.3.0.0 </h2> <h3> New Features: </h3> <ul> <li> <strong>PowerPoint Slide Control: </strong>Added ability to detect active PowerPoint presentation window and send next/previous slide commands, as well as start and end the slideshow directly from the app. </li> <li> <strong>Gemini AI Integration: </strong>Advent Media Player is now powered with AI using Google's Gemini API. A dedicated <em>'Gemini AI'</em> tab has been added to the settings panel, allowing users to securely input and manage their API key. This centralizes configuration for all current and future AI-driven features. </li> <li> <strong>Hymn Suggestions via AI: </strong>Introduced intelligent hymn recommendation based on worship type and timing. Suggestions are filtered against the media list to ensure lyrics are available and presentation-ready. </li> </ul> <h3>Enhancements: </h3> <ul> <li> <strong>JSON-Based Data Architecture: </strong>Revamped internal data handling by migrating from legacy `.txt` files to structured `.json` format. This enables faster parsing, better validation, and future-proof extensibility. </li> <li> <strong>Lyrics Sync Overhaul: </strong>Lyrics syncing is now fully integrated with the new JSON structure, eliminating the need for separate folder-based sync files. </li> </ul> <h3> Removed: </h3> <ul> <li><strong>Chroma Theme: </strong> Chroma theme screen support removed.</li> <li><strong>Edit List: </strong>Found under the 'Media' menu, this feature is now deprecated.</li> </ul><h2> Version 2.2.1.73 </h2> <h3> Enhancements: </h3> <ul> <li><strong>Changelog: </strong> Updated changelog text style.</li> <li><strong>Seek Bar: </strong> Hide seek bar on bible mode.</li></ul><h2> Version 2.2.1.72 </h2> <h3> Enhancements: </h3> <ul> <li> <strong>Custom Seek Bar Integration:</strong> Replaced the default Windows Media Player trackbar with a fully customized seek bar for enhanced flexibility, responsiveness, and visual appeal. </li> <li> <strong>Refined Indicator Aesthetics:</strong> Introduced a sleek 3D-styled playback thumb that darkens on direct hover, offering a more intuitive and modern interaction. </li> <li> <strong>Interactive Playback Scrubbing:</strong> Users can now click and drag the seek indicator to scrub through the media timeline with precision. </li> <li> <strong>Contextual Hover Feedback:</strong> Trackbar now dims gracefully on hover—only during active playback—creating a cohesive and responsive visual state. </li> </ul><h2>Version 2.2.1.69 </h2> <h3> Enhancements: </h3> <ul> <li><strong>Improved File Association Support:</strong> Seamlessly open supported media via <em>Open with &rarr; Advent Media Player</em>.</li> </ul> <h2> Version 2.2.1.68 </h2> <h3> New Features: </h3> <ul> <li><strong>Expanded Drag & Drop Support:</strong> You can now drag and drop <em>TXT, DOC, DOCX, PPT, and PPTX files</em> directly into Advent Media Player. The extracted text is <em>automatically processed and formatted</em> into lyrics with excess spacing removed for a clean layout.</li> <li><strong>Context Menu Integration:</strong> Right-click any supported video file (e.g., <em>.mp4, .avi, .mkv</em>) and select <em>\\\"Play with Advent Media Player\\\"</em> for instant playback.</li> <li><strong>\\\"Open With\\\" Support:</strong> Advent Media Player is now registered in the system’s <em>\\\"Open with\\\"</em> menu, allowing you to set it as the default media handler.</li> <li><strong>Multi-Screen Playback Support:</strong> Video playback now works properly on extended displays—even when launched via Explorer or context menu.</li> </ul> <h2> Version 2.2.1.66 </h2> <h3> New Features: </h3> <ul> <li><strong>Drag & Drop Support:</strong> Easily add media files by dragging and dropping directly into the player. Bulk drag-and-drop is also supported for efficient workflow.</li> <li><strong>Folder-to-Album Creation:</strong> Dropping a folder auto-creates a new album with the same name, streamlining organization.</li> </ul> <h2> Version 2.2.1.64 </h2> <h3> Fixes: </h3> <ul> <li><strong>Bible Search Correction:</strong> Now supports books with translated or alternate titles.</li> </ul> <h2> Version 2.2.1.63 </h2> <h3> Enhancements: </h3> <ul> <li><strong>Faster Bible Comparison:</strong> Reduced load times when comparing translations.</li> <li><strong>Changelog Viewer:</strong> Built-in changelog accessible from within the app.</li> </ul>"

  }
]
